{
  "content": "{\"name\": \"Ridgewood YMCA\", \"alternate_name\": \"\", \"description\": \"If you or someone you know is interested in receiving food boxes, please sign up today through this link https://lp.constantcontactpages.com/sl/iuQHRly/fooddistribution to receive our weekly email registration alerts. You will be notified when registration for the upcoming week opens. Spaces fill up quickly, and registration will close once they are full.\\nIf you or someone you know would like to shop the Beyond Pantry, please fill out the application https://reclique-core-ridgewood.s3.amazonaws.com/wp-content/uploads/2023/10/27084200/Beyond-Pantry-intake-form.pdf to see if you qualify for pantry assistance.\\n\\nSNAP Navigators\\nThe Ridgewood YMCA has been named a SNAP Navigator by the New Jersey Department of Human Services (NJDHS). We\\u2019re here to answer your questions about the NJ Supplemental Nutrition Assistance Program and help you apply for benefits. If you or someone you know is interested in learning more about SNAP, eligibility, or need help with applying, contact us at snap@ridgewoodymca.org\\n\\nThis is a free and confidential program.\\n\\nAbout NJ SNAP NJ SNAP is a nutrition assistance program to help individuals and families with low incomes buy the groceries they need to eat healthy with a benefits card accepted in most food retail stores and some farmer\\u2019s markets.\", \"email\": \"\", \"url\": \"https://www.ridgewoodymca.org/food-assistance-program/\", \"status\": \"active\", \"address\": {\"address_1\": \"112 Oak Street\", \"address_2\": null, \"city\": \"Ridgewood\", \"state_province\": \"NJ\", \"postal_code\": \"07450\", \"country\": \"US\"}, \"location\": {\"latitude\": 40.982871, \"longitude\": -74.1177541}, \"phones\": [{\"number\": \"(201) 444-5600\", \"type\": \"voice\"}], \"service_attributes\": [{\"attribute_key\": \"INFO\", \"attribute_value\": \"Pre-registration required\"}, {\"attribute_key\": \"REQUIREMENT\", \"attribute_value\": \"Registration on website required\"}]}",
  "metadata": {
    "scraper_id": "food_helpline_org",
    "source": "food_helpline_org"
  },
  "timestamp": "2025-08-06T08:40:18.110656"
}