{
  "content": "{\"id\": \"c698971a-2836-4375-b389-c43e7c67b68f\", \"name\": \"Foodbank of Southeastern Virginia and the Eastern Shore\", \"alternate_name\": \"\", \"description\": \"The Food Bank of Hampton Roads is dedicated to alleviating hunger and ensuring that everyone in our community has access to nutritious meals. With a mission to feed those in need, the Food Bank relies on the generosity of donors and volunteers to distribute food to thousands of families facing food insecurity each year.  If you want to make a difference, donating food is a great place to start. You can donate a variety of food items, including canned goods, fresh produce, and non-perishable items. Whether you're cleaning out your pantry or hosting a food drive, your contributions can help feed local families in need.  In today\\u2019s digital age, donating food online has become a quick and convenient way to give back. The Food Bank of Hampton Roads makes it simple for you to contribute financially or choose specific food items to donate, allowing you to help directly from your home. No matter how you contribute, your support is crucial in ensuring that no one goes hungry.  The Food Bank\\u2019s work extends beyond food donations; they also offer programs that provide meals to children, seniors, and families. Whether through financial donations or time volunteered, each effort helps to reduce food insecurity in our community.  Join us in supporting the Food Bank of Hampton Roads today. By donating or volunteering, you can make a lasting impact on the lives of those who need it most. Together, we can build a stronger, more compassionate community.\", \"email\": \"\", \"url\": \"\", \"status\": \"active\", \"address\": {\"address_1\": \"\", \"address_2\": \"\", \"city\": \"\", \"state_province\": \"\", \"postal_code\": \"\", \"country\": \"US\"}, \"phones\": [{\"number\": \"(757)6276599\", \"type\": \"voice\"}], \"location\": {\"latitude\": 36.8520252, \"longitude\": -76.27452939999999}, \"regular_schedule\": []}",
  "metadata": {
    "scraper_id": "getfull_app_api",
    "source": "getfull_app_api"
  },
  "timestamp": "2025-08-08T05:26:28.827908"
}