{
  "content": "{\"name\": \"Maryland Access Point, Charles County\", \"alternate_name\": \"\", \"description\": \"OVERVIEW: Offers assistance for seniors and individuals, 18 and older with disabilities. It is a statewide resource for information and assistance about long-term services and supports to allow individuals to remain at home and plan for future needs.  SERVICES: 1) AGING AND DISABILITY RESOURCE CENTER: Provides individuals who are seeking long term support information and counseling regarding available long term support options, and determining eligibility for public long term support programs and benefits. Benefits screening includes level of care determinations for Medicaid nursing facility and home and community-based service waiver programs.   2) SENIOR FARMERS' MARKET NUTRITION PROGRAM: Provides vouchers to low-moderate income older adults for use at local farmers' markets in the community. Vouchers are provided in the summer (usually in June). Call for more information on eligibility, distribution sites, days, and times. Find a market here.3) INFORMATION AND ASSISTANCE: Offers in person assistance to individuals, families and caregivers with questions and/or concerns.4) INFORMATION AND REFERRAL: Connects individuals with information and referrals to other programs and benefits (such as health promotion and disease prevention, transportation services, housing and income support programs) that may help people remain in the community.\", \"email\": \"\", \"url\": \"https://charlescountywebsite.com/Charles_County_Waldorf_MD_local_government_officials_representative_committee_board_election_MD.html\", \"status\": \"active\", \"address\": {\"address_1\": \"200 Baltimore Ave\", \"address_2\": null, \"city\": \"La Plata\", \"state_province\": \"MD\", \"postal_code\": \"20646\", \"country\": \"US\"}, \"location\": {\"latitude\": 38.53061, \"longitude\": -76.98055}, \"phones\": [{\"number\": \"(855) 843-9725\", \"type\": \"voice\"}], \"regular_schedule\": [{\"weekday\": \"Wednesday\", \"opens_at\": \"\", \"closes_at\": \"\"}, {\"weekday\": \"Saturday\", \"opens_at\": \"\", \"closes_at\": \"\"}]}",
  "metadata": {
    "scraper_id": "food_helpline_org",
    "source": "food_helpline_org"
  },
  "timestamp": "2025-08-06T08:40:28.953085"
}