{
  "content": "{\"city\": \"Hercules\", \"state\": \"CA\", \"name\": \"Community Produce Program\", \"address\": \"111 Civic Dr,\", \"phone\": \"925-676-7543\", \"notes\": \"Partner Agency Volunteer Partner Agency Volunteer Search About Us About Us Our Programs Who We Are Financials Blog Newsroom Careers Contact Ways to Give Ways to Donate Give Food Give Stock Legacy Giving Corporate Giving Other Ways to Give Get Involved Volunteer Advocate Host a Fund Drive Events & Promotions Find Food Find Food in My City CalFresh Nutrition & Recipes Donate About Us About Us Our Programs Who We Are Financials Blog Newsroom Careers Contact Ways to Give Ways to Donate Give Food Give Stock Legacy Giving Corporate Giving Other Ways to Give Get Involved Volunteer Advocate Host a Fund Drive Events & Promotions Find Food Find Food in My City CalFresh Nutrition & Recipes Donate Search About Us About Us Our Programs Who We Are Financials Blog Newsroom Careers Contact Ways to Give Ways to Donate Give Food Give Stock Legacy Giving Corporate Giving Other Ways to Give Get Involved Volunteer Advocate Host a Fund Drive Events & Promotions Find Food Find Food in My City CalFresh Nutrition & Recipes Donate About Us About Us Our Programs Who We Are Financials Blog Newsroom Careers Contact Ways to Give Ways to Donate Give Food Give Stock Legacy Giving Corporate Giving Other Ways to Give Get Involved Volunteer Advocate Host a Fund Drive Events & Promotions Find Food Find Food in My City CalFresh Nutrition & Recipes Donate Partner Agency Volunteer Partner Agency Volunteer Get Food Hercules Printer Friendly List Community Produce Program Families and individuals can pick up to 20 pounds of FREE fresh produce twice a month. Please choose ONE location. Hercules Senior Center , 111 Civic Dr, Hercules , 1st & 3rd Tuesday 11:00am-12:00pm.\\n\\t\\t\\t\\t\\t\\t\\tPlease bring two bags with handles. Senior Food Program FREE groceries twice a month to individuals aged 55 or older who meet income guidelines. Only one senior per household can receive food. Bring a picture ID and proof of address (PG&E bill, for example). Hercules Senior Center , 111 Civic Center, Hercules , 2nd & 4th Tuesday 10:00-11:00am. Printer Friendly List Locations Concord: 925-676-7543 4010 Nelson Ave\\nConcord, CA 94520 Fairfield: 707-421-9777 2370 N Watney Way\\nFairfield, CA 94533 GET HELP Find Food CalFresh Nutrition & Recipes Contact Us 855-309-FOOD\\u00a0(3663) info@foodbankccs.org How to Help Ways to Give Donate Food Volunteer Advocate Become a Partner Agency Food Bank Updates Blog Events Newsroom Newsletter Sign-up Careers Facebook Twitter Youtube Instagram Linkedin 501(c)(3) Organization | Federal Tax ID# 94-2418054 Copyright \\u00a9 2025 Cookie Settings This institution is an equal opportunity provider | Site Map | Privacy Policy Website Design and Development by MIGHTYminnow\", \"latitude\": 38.010428989311, \"longitude\": -122.265761979979, \"source\": \"food_bank_of_contra_costa_and_solano_ca\", \"food_bank\": \"Food Bank of Contra Costa and Solano\"}",
  "metadata": {
    "scraper_id": "food_bank_of_contra_costa_and_solano_ca",
    "source": "food_bank_of_contra_costa_and_solano_ca"
  },
  "timestamp": "2025-08-08T05:05:44.926894"
}