{
  "content": "{\"locationId\": \"17151\", \"organizationId\": \"10569\", \"name\": \"Bread of Life Food Pantry\", \"address1\": \"301 State Hwy 224\", \"address2\": null, \"city\": \"Commerce\", \"state\": \"TX\", \"zipCode\": \"75428\", \"country\": null, \"phone\": \"903-886-1515\", \"phoneExt\": null, \"website\": \"bol-community.org\", \"latitude\": \"33.2584003\", \"longitude\": \"-95.9007765\", \"foodPrograms\": \"Food Distribution\", \"serviceAreas\": \"\", \"languages\": \"English\", \"features\": \"\", \"aboutUs\": \"We are located on the hill behind Exxon.  Distributions are drive-through only.  New clients need to bring a photo ID and proof of residence.  Example: lease, or bill.  Please, clean out your trunk before you come.  We give out a shopping cart full of items.     Bread of Life Food Pantry   distributes free food to those in need on the first Friday after the first Wednesday 10:00am to 2:00pm and on the 3rd Wed of the month 4:30pm to 7:30pm. We also distribute Senior Commodities at both distributions. Located at 301 Hwy 224, Commerce, TX. Most boxes consist of canned vegetables, rice, pasta, peanut butter, cereal, juice, and canned meat. We also offer frozen meat, and fresh produce when in stock. New clients bring a photo ID and proof of address. For example, current utility bill or student ID. Volunteers and donations are always welcome. For Questions call 903-886-1515 or email us at bolfp@commercenazarene.org    Hunt County Senior Commodities   Distribution offers commodity boxes to individuals 60 and over living in Hunt County, on the 1st Friday after the first Wednesday of the month and the third Wednesday of the month. Located at 301 Hwy 224, Commerce, TX. Individuals must qualify. To do so bring photo Id and proof of physical address. Also offered for those who qualify for commodity boxes, are the Bread of Life Food Pantry boxes. Volunteers and donations are always welcome. For Questions call 903-886-1515 or email us at bolfp@commercenazarene.org\", \"notes\": \"On the hill behind Exxon.  Drive through only.  Clean out your trunk.\", \"contactName\": \"LesLee Lay\", \"contactPhone\": \"903-886-1515\", \"contactEmail\": \"bolfp@commercenazarene.org\", \"servicePrograms\": \"\", \"foodServiceTypes\": \"CSFP Program, Curbside Pickup / Drive Through, Home Delivery Service, TEFAP Program\", \"dietRestrictions\": \"\", \"foodOfferings\": \"\", \"networkAffiliations\": [], \"timeZoneName\": \"Central Standard Time\", \"timeZoneCode\": \"CT\", \"offsetHours\": \"-5\", \"schedules\": [\"Wednesday 4:30 PM-7:30 PM (Contact for schedule.) [ 3rd week(s)]\", \"Friday 10:00 AM-2:00 PM (First Friday FOLLOWING the first Wednesday. Contact for schedule.) [ 1st week(s)]\"], \"services\": [], \"specialHours\": []}",
  "metadata": {
    "scraper_id": "vivery_api",
    "source": "vivery_api"
  },
  "timestamp": "2025-08-08T05:39:40.657937"
}